Repository: JiangNanGenius/call-message-relay-ios
Catalog: CallRelay/Localizable.xcstrings
Source language: zh_hans
Languages: en, zh_hant

source: · 更新于 %@
en: · Updated %@
zh_hant: · 更新於 %@

source: %@ · 已保持
en: %@ · On hold
zh_hant: %@ · 已保留

source: %lld 个号码
en: %lld numbers
zh_hant: %lld 個號碼

source: HTTPS 链接（纯 TXT 或 JSON，≤2MB，≤50000 个号码）
en: HTTPS link (plain TXT or JSON, ≤2MB, ≤50,000 numbers)
zh_hant: HTTPS 連結（純 TXT 或 JSON，≤2MB，≤50000 個號碼）

source: ICE 候选收集超时，无法在限定时间内准备音频。
en: ICE candidate gathering timed out; audio could not be prepared in time.
zh_hant: ICE 候選收集逾時，無法在限定時間內準備音訊。

source: iCloud 同步
en: iCloud Sync

source: iCloud 同步（可选）
en: iCloud Sync (optional)
zh_hant: iCloud 同步（可選）

source: SIM 卡
en: SIM card

source: SIM 已更换
en: SIM changed
zh_hant: SIM 已更換

source: SIM 未存号码
en: SIM has no stored number
zh_hant: SIM 未存號碼

source: 不会同步
en: Won't sync
zh_hant: 不會同步

source: 不可用
en: Unavailable

source: 中继
en: Relay
zh_hant: 中繼

source: 中继 · %lldms
en: Relay · %lldms
zh_hant: 中繼 · %lldms

source: 中继 · 切换中…
en: Relay · switching…
zh_hant: 中繼 · 切換中…

source: 仅在你点击授权后读取；联系人保存在本机/iCloud，不会上传，也不会用于演示或日志。你随时可在系统设置中关闭。
en: Read only after you tap authorize; contacts stay on this device/iCloud, are never uploaded, and are never used for demos or logs. You can turn this off in Settings anytime.
zh_hant: 僅在你點按授權後讀取；聯絡人保存在本機/iCloud，不會上傳，也不會用於示範或日誌。你隨時可在系統設定中關閉。

source: 仅按完整号码匹配，不会因为号段或归属地拦截普通号码；信任名单和你的拦截号码始终优先。更新失败会保留上一份可用名单。
en: Matches full numbers only — ordinary numbers are never blocked by prefix or region. Your trusted list and blocked numbers always win. A failed update keeps the last usable list.
zh_hant: 僅按完整號碼比對，不會因為號段或歸屬地攔截普通號碼；信任名單和你的攔截號碼始終優先。更新失敗會保留上一份可用名單。

source: 仅控制
en: Control only
zh_hant: 僅控制

source: 仅本次使用
en: Just this call
zh_hant: 僅本次使用

source: 仅退出这台手机，其他设备不受影响。
en: Only this phone is unpaired; other devices are unaffected.
zh_hant: 僅退出這台手機，其他裝置不受影響。

source: 从 HTTPS 链接更新
en: Update from HTTPS Link
zh_hant: 從 HTTPS 連結更新

source: 从 vCard 导入
en: Import from vCard
zh_hant: 從 vCard 匯入

source: 从剪贴板粘贴
en: Paste from Clipboard
zh_hant: 從剪貼簿貼上

source: 从剪贴板粘贴收件人
en: Paste Recipient from Clipboard
zh_hant: 從剪貼簿貼上收件人

source: 从文件导入
en: Import from File
zh_hant: 從檔案匯入

source: 会议中无法切换。
en: Cannot switch during a conference.
zh_hant: 會議中無法切換。

source: 会议中无法切换直连。
en: Cannot switch during a conference.
zh_hant: 會議中無法切換直連。

source: 会议成员
en: Participants
zh_hant: 會議成員

source: 会议线路
en: Conference
zh_hant: 會議線路

source: 会议音频连接中断。
en: Conference audio connection lost.
zh_hant: 會議音訊連線中斷。

source: 会议音频长时间未恢复，已结束。
en: Conference audio did not recover and has ended.
zh_hant: 會議音訊長時間未恢復，已結束。

source: 使用默认线路
en: Use Default Line
zh_hant: 使用預設線路

source: 保存
en: Save
zh_hant: 儲存

source: 保存/分享备份
en: Save/Share Backup
zh_hant: 儲存/分享備份

source: 保守预设（全部默认关闭）
en: Conservative preset (all defaults off)
zh_hant: 保守預設（全部預設關閉）

source: 保持
en: Hold
zh_hant: 保留

source: 保持中的通话
en: On hold
zh_hant: 保留中的通話

source: 保持当前线路
en: Keep current route
zh_hant: 保持當前線路

source: 信号
en: Signal
zh_hant: 訊號

source: 信息 · 短信
en: Messages · SMS
zh_hant: 資訊 · 簡訊

source: 信息·短信
en: Messages·SMS
zh_hant: 資訊·簡訊

source: 修改会同步到其他已授权手机。
en: Changes sync to your other authorized phones.
zh_hant: 修改會同步到其他已授權手機。

source: 停止播放
en: Stop Playing

source: 停用跨设备自动恢复
en: Disable Cross-Device Recovery
zh_hant: 停用跨裝置自動恢復

source: 允许本机 HTTP 调试（仅 localhost）
en: Allow Local HTTP Debugging (localhost only)
zh_hant: 允許本機 HTTP 偵錯（僅 localhost）

source: 全部线路
en: All Lines
zh_hant: 全部線路

source: 关于
en: About
zh_hant: 關於

source: 关闭提示
en: Dismiss
zh_hant: 關閉提示

source: 最近通话
en: Recents
zh_hant: 最近通話

source: 写入
en: Write
zh_hant: 寫入

source: 分享导出的 vCard
en: Share Exported vCard
zh_hant: 分享匯出的 vCard

source: 切换中
en: Switching
zh_hant: 切換中

source: 切换中…
en: Switching…
zh_hant: 切換中…

source: 切换失败，继续使用中继。
en: Switch failed; staying on relay.
zh_hant: 切換失敗，繼續使用中繼。

source: 删除
en: Delete
zh_hant: 刪除

source: 删除一位
en: Delete One
zh_hant: 刪除一位

source: 删除留言
en: Delete Message
zh_hant: 刪除留言

source: 删除该名单
en: Delete This List
zh_hant: 刪除該名單

source: 删除这条语音留言？
en: Delete this voicemail?
zh_hant: 刪除這則語音留言？

source: 占线
en: Busy
zh_hant: 佔線

source: 发件号码
en: Sender Number
zh_hant: 發件號碼

source: 发短信
en: Send SMS
zh_hant: 發簡訊

source: 发短信给 %@
en: Text %@
zh_hant: 發簡訊給 %@

source: 发送
en: Send
zh_hant: 傳送

source: 发送中…
en: Sending…
zh_hant: 傳送中…

source: 取消
en: Cancel

source: 只会导入勾选的联系人；不会删除或覆盖现有内容。建议先导出备份。
en: Only checked contacts are imported; nothing existing is deleted or overwritten. Export a backup first.
zh_hant: 只會匯入勾選的聯絡人；不會刪除或覆蓋現有內容。建議先匯出備份。

source: 只读系统通讯录，不删除、不改写。
en: Read-only access to system contacts; nothing deleted or modified.
zh_hant: 唯讀系統通訊錄，不刪除、不改寫。

source: 可用
en: Available

source: 号码
en: Number
zh_hant: 號碼

source: 号码 %@ 命中：%@。这是本机拦截，未通过网关呼出；可在短信/通话规则里修改。
en: Number %@ matched: %@. Blocked on this device — no gateway call was placed; adjust it in SMS/call rules.
zh_hant: 號碼 %@ 命中：%@。這是本機攔截，未透過網關撥出；可在簡訊/通話規則裡修改。

source: 号码（3–20 位数字，可带开头 +）
en: Number (3–20 digits, may start with +)
zh_hant: 號碼（3–20 位數字，可帶開頭 +）

source: 号码名单
en: Number Lists
zh_hant: 號碼名單

source: 号码名单（来电）
en: Number Lists (Calls)
zh_hant: 號碼名單（來電）

source: 号码来源
en: Number Source
zh_hant: 號碼來源

source: 合并刚导出的 vCard
en: Merge Just-Exported vCard
zh_hant: 合併剛匯出的 vCard

source: 合并到现有
en: Merge into Existing
zh_hant: 合併到現有

source: 合并到现有联系人（保留已有内容）
en: Merge into Existing Contacts (keeps current content)
zh_hant: 合併到現有聯絡人（保留已有內容）

source: 同名且号码/邮箱相同（默认合并）
en: Same name and same number/email (merge by default)
zh_hant: 同名且號碼/信箱相同（預設合併）

source: 同步使用 iCloud 私人数据库，号码、正文、姓名写入加密字段（CKRecord.encryptedValues）。不同网关的历史互不混合；下载的历史只读，绝不会因此再发短信或拨号。
en: Sync uses your iCloud private database; numbers, bodies and names are written to encrypted fields (CKRecord.encryptedValues). Histories from different gateways never mix; downloaded history is read-only and will never send texts or place calls.
zh_hant: 同步使用 iCloud 私人資料庫，號碼、正文、姓名寫入加密欄位（CKRecord.encryptedValues）。不同網關的歷史互混合；下載的歷史唯讀，絕不會因此再發簡訊或撥號。

source: 同步内容
en: Sync Content
zh_hant: 同步內容

source: 名称
en: Name
zh_hant: 名稱

source: 启用 iCloud 私人同步
en: Enable iCloud Private Sync
zh_hant: 啟用 iCloud 私人同步

source: 呼叫 %@
en: Call %@
zh_hant: 撥打給 %@

source: 呼叫该号码
en: Call This Number
zh_hant: 撥打該號碼

source: 回复短信
en: Reply by SMS
zh_hant: 回覆簡訊

source: 回拨
en: Call Back
zh_hant: 回撥

source: 在导出的 vCard 中合并勾选的重复项
en: Merge checked duplicates in the exported vCard
zh_hant: 在匯出的 vCard 中合併勾選的重複項

source: 在系统「通讯录」里清理、合并或导入后，此处会自动刷新；App 不维护第二份通讯录。
en: Clean up, merge or import in system Contacts and this refreshes automatically; the app keeps no second copy.
zh_hant: 在系統「通訊錄」裡清理、合併或匯入後，此處會自動重新整理；App 不維護第二份通訊錄。

source: 在系统设置中管理本 App 权限
en: Manage This App's Permissions in Settings
zh_hant: 在系統設定中管理本 App 權限

source: 在线
en: Online
zh_hant: 線上

source: 垃圾拦截规则
en: Spam Blocking Rules
zh_hant: 垃圾攔截規則

source: 垃圾规则与信任号码
en: Spam Rules & Trusted Numbers
zh_hant: 垃圾規則與信任號碼

source: 处理方式
en: Action
zh_hant: 處理方式

source: 备份已生成，重新导出
en: Backup created; export again
zh_hant: 備份已產生，重新匯出

source: 外呼
en: Outbound
zh_hant: 外撥

source: 多方会议 · %lld 方
en: Conference · %lld parties
zh_hant: 多方會議 · %lld 方

source: 完全离线，不联网、不发短信、不触发真实系统来电
en: Fully offline — no network, no SMS, no real system calls
zh_hant: 完全離線，不連網、不發簡訊、不觸發真實系統來電

source: 完成
en: Done

source: 完成配对
en: Complete Pairing
zh_hant: 完成配對

source: 导入
en: Import
zh_hant: 匯入

source: 导入中…
en: Importing…
zh_hant: 匯入中…

source: 导入勾选的联系人（%lld 项）
en: Import Checked Contacts (%lld)
zh_hant: 匯入勾選的聯絡人（%lld 項）

source: 导入号码名单
en: Import Number List
zh_hant: 匯入號碼名單

source: 导入联系人
en: Import Contacts
zh_hant: 匯入聯絡人

source: 导入这些联系人？
en: Import these contacts?
zh_hant: 匯入這些聯絡人？

source: 导出 vCard (.vcf)
en: Export vCard (.vcf)
zh_hant: 匯出 vCard (.vcf)

source: 导出/分享（不写入系统）
en: Export/Share (not written to system)
zh_hant: 匯出/分享（不寫入系統）

source: 导出后条数
en: Entries After Export
zh_hant: 匯出後筆數

source: 导出备份 (.vcf)
en: Export Backup (.vcf)
zh_hant: 匯出備份 (.vcf)

source: 将从网关删除录音文件，此操作不可撤销。
en: The recording will be deleted from the gateway. This cannot be undone.
zh_hant: 將從網關刪除錄音檔案，此操作無法復原。

source: 将选中一方移出会议
en: Remove selected participant from conference
zh_hant: 將選取一方移出會議

source: 就绪
en: Ready
zh_hant: 就緒

source: 已存在
en: Already Exists

source: 已存在，无需写入
en: Already exists; nothing to write
zh_hant: 已存在，無需寫入

source: 已按拦截规则阻止
en: Blocked by spam rules
zh_hant: 已按攔截規則封鎖

source: 已注册
en: Registered
zh_hant: 已註冊

source: 已选中的通话方
en: Selected participant
zh_hant: 已選取的通話方

source: 已锁定
en: Locked
zh_hant: 已鎖定

source: 开启后，你通讯录里的号码不会进入垃圾信息；你手动加入的拦截号码仍然优先生效。
en: When on, numbers in your contacts won't be flagged as spam; numbers you blocked manually still take precedence.
zh_hant: 開啟後，你通訊錄裡的號碼不會進入垃圾訊息；你手動加入的攔截號碼仍然優先生效。

source: 当前为受限访问：只能匹配你选中的联系人，不能代表整本通讯录。请在系统设置中允许完全访问后再做完整清理。
en: Limited access: only the contacts you select can be matched — this doesn't represent your whole contacts. Allow full access in Settings before a full cleanup.
zh_hant: 目前為受限存取：只能比對你選取的聯絡人，不能代表整本通訊錄。請在系統設定中允許完整存取後再做完整清理。

source: 当前为受限访问：只能看到你选中的联系人，不能代表整本通讯录。
en: Limited access: you only see the contacts you select — this doesn't represent your whole contacts.
zh_hant: 目前為受限存取：只能看到你選取的聯絡人，不能代表整本通訊錄。

source: 当前是旧版按线路配对，无法显示统一网关的线路号码。
en: This is a legacy per-line pairing; unified gateway line numbers can't be shown.
zh_hant: 目前是舊版按線路配對，無法顯示統一網關的線路號碼。

source: 当前状态无法切换直连，继续使用中继。
en: Cannot switch to direct right now; staying on relay.
zh_hant: 目前狀態無法切換直連，繼續使用中繼。

source: 当前签名没有 iCloud 容器权限，该开关不可用；使用包含 iCloud 能力的描述文件重新签名后即可开启。系统 iCloud 联系人同步不受影响。
en: This build's signature lacks the iCloud container entitlement, so this switch is unavailable; re-sign with an iCloud-capable profile to enable it. System iCloud contact sync is unaffected.
zh_hant: 目前簽章沒有 iCloud 容器權限，此開關不可用；使用包含 iCloud 能力的描述檔重新簽署後即可開啟。系統 iCloud 聯絡人同步不受影響。

source: 当前网关不支持直连，无法按你的选择使用直连；可改用自动模式。
en: This gateway doesn't support direct, so your choice can't be applied; you can switch to Auto.
zh_hant: 目前閘道不支援直連，無法依你的選擇使用直連；可改用自動模式。

source: 待发送的设备短信
en: Outgoing Device SMS
zh_hant: 待傳送的裝置簡訊

source: 恢复
en: Restore
zh_hant: 恢復

source: 恢复 SIM 自动读取
en: Restore SIM Auto-Read
zh_hant: 恢復 SIM 自動讀取

source: 恢复为 SIM 自动读取的号码？
en: Restore the number read from the SIM?
zh_hant: 恢復為 SIM 自動讀取的號碼？

source: 恢复自动读取
en: Restore Auto-Read
zh_hant: 恢復自動讀取

source: 恢复通话
en: Resume call
zh_hant: 恢復通話

source: 我的号码名单
en: My Number Lists
zh_hant: 我的號碼名單

source: 所有规则只保存在本机，不会上传短信内容或号码。客户端拦截发生在收到网关来电之后，不能保证对方线路“完全不响铃”；系统电话/短信过滤扩展不在本 App 范围内。
en: All rules stay on this device — no message content or numbers are uploaded. Client blocking happens after the gateway call reaches you, so the caller's line may still ring briefly; system call/SMS filter extensions are out of scope.
zh_hant: 所有規則只保存在本機，不會上傳簡訊內容或號碼。用戶端攔截發生在收到網關來電之後，無法保證對方線路「完全不響鈴」；系統電話/簡訊過濾擴充功能不在本 App 範圍內。

source: 手动号码
en: Manual Number
zh_hant: 手動號碼

source: 手动设置
en: Manual
zh_hant: 手動設定

source: 打开系统设置
en: Open Settings
zh_hant: 打開系統設定

source: 扫描二维码
en: Scan QR Code
zh_hant: 掃描 QR 圖碼

source: 扫码或粘贴控制台生成的配对内容，即可连接你的号码与设备。
en: Scan or paste the pairing content generated by the console to link your numbers with this device.
zh_hant: 掃碼或貼上控制台產生的配對內容，即可連接你的號碼與裝置。

source: 拒绝
en: Decline
zh_hant: 拒絕

source: 拒绝来电
en: Decline call
zh_hant: 拒絕來電

source: 拨号键盘
en: Keypad
zh_hant: 撥號鍵盤

source: 拨打
en: Call
zh_hant: 撥打

source: 拨打 %@
en: Call %@
zh_hant: 撥打 %@

source: 拨打号码
en: Dial Number
zh_hant: 撥打號碼

source: 拷贝
en: Copy
zh_hant: 拷貝

source: 挂断
en: Hang Up
zh_hant: 掛斷

source: 按线路筛选
en: Filter by Line
zh_hant: 按線路篩選

source: 授权已失效
en: Authorization Expired
zh_hant: 授權已失效

source: 授权访问通讯录
en: Authorize Contacts Access
zh_hant: 授權存取通訊錄

source: 探测直连…
en: Checking direct…
zh_hant: 探測直連…

source: 接听
en: Answer
zh_hant: 接聽

source: 接听当前模拟来电
en: Answer Current Simulated Call
zh_hant: 接聽目前模擬來電

source: 接听来电
en: Answer call
zh_hant: 接聽來電

source: 搜索中
en: Searching
zh_hant: 搜尋中

source: 搜索联系人或号码
en: Search contacts or numbers
zh_hant: 搜尋聯絡人或號碼

source: 播放留言
en: Play Message

source: 支持 App 导出的 .vcf 与标准 vCard 3.0 文件；只在本机解析，不会上传。
en: Supports app-exported .vcf and standard vCard 3.0 files; parsed on-device only, never uploaded.
zh_hant: 支援 App 匯出的 .vcf 與標準 vCard 3.0 檔案；只在本機解析，不會上傳。

source: 收件人
en: Recipient

source: 收件人号码
en: Recipient Number
zh_hant: 收件人號碼

source: 收短信
en: Receive SMS
zh_hant: 收簡訊

source: 改用自动模式
en: Switch to Auto
zh_hant: 改用自動模式

source: 整理与导出联系人
en: Organize & Export Contacts
zh_hant: 整理與匯出聯絡人

source: 文件
en: File
zh_hant: 檔案

source: 新增
en: Add

source: 新增联系人
en: New Contact
zh_hant: 新增聯絡人

source: 新建短信
en: New Message
zh_hant: 新增簡訊

source: 无
en: None
zh_hant: 無

source: 无人接听或设备离线时，来电会自动转入语音留言。
en: When no one answers or the device is offline, incoming calls go to voicemail automatically.
zh_hant: 無人接聽或裝置離線時，來電會自動轉入語音留言。

source: 无法切回中继，仍保持当前线路。
en: Couldn't switch to relay; kept current route.
zh_hant: 無法切回中繼，仍保持目前線路。

source: 无法创建音频连接。
en: Could not create the audio connection.
zh_hant: 無法建立音訊連線。

source: 无法启用通话音频，请重试。
en: Could not activate call audio. Please try again.
zh_hant: 無法啟用通話音訊，請重試。

source: 无法生成本地音频协商信息。
en: Could not create the local audio negotiation data.
zh_hant: 無法產生本機音訊協商資訊。

source: 暂无可选线路
en: No lines available
zh_hant: 暫無可選線路

source: 暂时无法通过网关拨打
en: Can't dial via the gateway right now
zh_hant: 暫時無法透過網關撥打

source: 未插入
en: Not inserted

source: 未知
en: Unknown

source: 未能在限定时间内接通音频。
en: Audio could not connect within the time limit.
zh_hant: 未能在限定時間內接通音訊。

source: 未读 %lld 条
en: %lld unread
zh_hant: 未讀 %lld 則

source: 权限
en: Permissions
zh_hant: 權限

source: 来源
en: Source
zh_hant: 來源

source: 查看%@详情
en: View %@ Details
zh_hant: 查看%@詳情

source: 标记为已知发件人
en: Mark as Known Sender
zh_hant: 標記為已知發件人

source: 检测到重复组
en: Duplicate Groups Detected
zh_hant: 偵測到重複群組

source: 模拟一通来电
en: Simulate Incoming Call
zh_hant: 模擬一通來電

source: 模拟收到一条短信
en: Simulate Receiving an SMS
zh_hant: 模擬收到一則簡訊

source: 正在切换线路…
en: Switching route…
zh_hant: 正在切換線路…

source: 正在载入对话…
en: Loading conversation…
zh_hant: 正在載入對話…

source: 正在载入短信…
en: Loading messages…
zh_hant: 正在載入簡訊…

source: 正在配对…
en: Pairing…
zh_hant: 正在配對…

source: 正文
en: Body
zh_hant: 內文

source: 每台 iPhone 仍需分别配对网关；本 App 不使用公共数据库，也不上传统计数据。
en: Each iPhone still pairs with the gateway individually; this app uses no public database and uploads no analytics.
zh_hant: 每台 iPhone 仍需分別配對網關；本 App 不使用公共資料庫，也不上傳統計資料。

source: 注册
en: Sign Up
zh_hant: 註冊

source: 测试这条短信
en: Test This Message
zh_hant: 測試這則簡訊

source: 添加
en: Add
zh_hant: 加入

source: 添加规则
en: Add Rule
zh_hant: 加入規則

source: 清空号码
en: Clear Number
zh_hant: 清除號碼

source: 源代码仓库
en: Source Code Repository
zh_hant: 原始碼倉庫

source: 演示模式
en: Demo Mode
zh_hant: 示範模式

source: 演示模式：短信只保存在本机内存中，不会联网或真正发送。
en: Demo mode: messages live only in this device's memory — nothing is sent over the network.
zh_hant: 示範模式：簡訊只保存在本機記憶體中，不會連網或真正傳送。

source: 演示模式（离线）
en: Demo Mode (Offline)
zh_hant: 示範模式（離線）

source: 状态
en: Status
zh_hant: 狀態

source: 疑似垃圾：%@
en: Possible spam: %@

source: 直连
en: Direct
zh_hant: 直連

source: 直连 · %lldms
en: Direct · %lldms
zh_hant: 直連 · %lldms

source: 直连 · 切换中…
en: Direct · switching…
zh_hant: 直連 · 切換中…

source: 直连 · 质量差
en: Direct · poor quality
zh_hant: 直連 · 品質差

source: 直连不可用，继续使用中继。
en: Direct unavailable; staying on relay.
zh_hant: 直連不可用，繼續使用中繼。

source: 直连候选在限定时间内未连通。
en: The direct candidate didn't connect in time.
zh_hant: 直連候選在限定時間內未連通。

source: 直连候选无法建立。
en: Couldn't create a direct candidate.
zh_hant: 直連候選無法建立。

source: 直连已中断，当前使用中继。
en: Direct ended; now on relay.
zh_hant: 直連已中斷，目前使用中繼。

source: 直连质量下降，已恢复中继。
en: Direct quality dropped; relay restored.
zh_hant: 直連品質下降，已恢復中繼。

source: 直连音频未就绪，已恢复中继。
en: Direct audio was not ready; relay restored.
zh_hant: 直連音訊未就緒，已恢復中繼。

source: 直连质量差，可手动切换中继。
en: Direct quality is poor; you can switch to relay.
zh_hant: 直連品質差，可手動切換中繼。

source: 知道了
en: Got It

source: 短信
en: SMS
zh_hant: 簡訊

source: 短信/通话/规则同步
en: SMS/Call/Rule Sync
zh_hant: 簡訊/通話/規則同步

source: 短信与来电
en: SMS & Calls
zh_hant: 簡訊與來電

source: 短信内容
en: Message Content
zh_hant: 簡訊內容

source: 短信正文
en: Message Body
zh_hant: 簡訊本文

source: 短信记录
en: Message History
zh_hant: 簡訊記錄

source: 短信通过已配对网关发送，发送进度会显示在对话中。
en: Messages are sent through your paired gateway; progress appears in the conversation.
zh_hant: 簡訊透過已配對網關傳送，傳送進度會顯示在對話中。

source: 离线
en: Offline
zh_hant: 離線

source: 移除
en: Remove

source: 立即同步
en: Sync Now

source: 立即更新
en: Update Now

source: 筛选短信
en: Filter Messages
zh_hant: 篩選簡訊

source: 管理导入的号码名单
en: Manage Imported Number Lists
zh_hant: 管理匯入的號碼名單

source: 类型
en: Type
zh_hant: 類型

source: 粘贴
en: Paste
zh_hant: 貼上

source: 粘贴号码（每行一个，支持 # 注释）
en: Paste numbers (one per line, # comments supported)
zh_hant: 貼上號碼（每行一個，支援 # 註解）

source: 粘贴号码导入
en: Paste Numbers to Import
zh_hant: 貼上號碼匯入

source: 系统权限
en: System Permissions
zh_hant: 系統權限

source: 线路
en: Line
zh_hant: 線路

source: 线路不可用，继续使用中继。
en: Line unavailable; staying on relay.
zh_hant: 線路不可用，繼續使用中繼。

source: 线路切换
en: Route change
zh_hant: 線路切換

source: 线路号码
en: Line Number
zh_hant: 線路號碼

source: 线路详情
en: Line Details
zh_hant: 線路詳情

source: 线路选项
en: Line Options
zh_hant: 線路選項

source: 结束会议
en: End Conference
zh_hant: 結束會議

source: 编辑
en: Edit
zh_hant: 編輯

source: 编辑%@号码
en: Edit %@ Number
zh_hant: 編輯%@號碼

source: 网关
en: Gateway
zh_hant: 網關

source: 网关不支持直连，继续使用中继。
en: Gateway doesn't support direct; staying on relay.
zh_hant: 閘道不支援直連，繼續使用中繼。

source: 网络
en: Network
zh_hant: 網路

source: 联系人
en: Contacts
zh_hant: 聯絡人

source: 联系人总数
en: Total Contacts
zh_hant: 聯絡人總數

source: 联系人整理与导入
en: Contact Cleanup & Import
zh_hant: 聯絡人整理與匯入

source: 能力
en: Capabilities

source: 自动
en: Auto
zh_hant: 自動

source: 若未预期会收到来自未知发件人的这则信息，其可能为垃圾信息。命中规则：%@
en: If you didn't expect this message from an unknown sender, it may be spam. Matched rule: %@
zh_hant: 若未預期會收到來自未知寄件人的這則訊息，其可能為垃圾訊息。命中規則：%@

source: 被拒绝
en: Denied
zh_hant: 被拒絕

source: 规则
en: Rules
zh_hant: 規則

source: 规则测试（不上传内容）
en: Rule Test (no content uploaded)
zh_hant: 規則測試（不上傳內容）

source: 让下一条演示短信发送失败（可重试）
en: Make the Next Demo Message Fail (retryable)
zh_hant: 讓下一則示範簡訊傳送失敗（可重試）

source: 设为默认并拨打
en: Set as Default & Dial
zh_hant: 設為預設並撥打

source: 设置
en: Settings
zh_hant: 設定

source: 语音
en: Voice
zh_hant: 語音

source: 语音留言
en: Voicemail
zh_hant: 語音留言

source: 语音留言（%lld）
en: Voicemail (%lld)
zh_hant: 語音留言（%lld）

source: 请在系统设置中允许访问通讯录，或使用“受限访问”仅选择部分联系人。
en: Allow contacts access in Settings, or use “Limited Access” to pick specific contacts only.
zh_hant: 請在系統設定中允許存取通訊錄，或使用「受限存取」僅選擇部分聯絡人。

source: 请重新配对以恢复连接。
en: Please pair again to restore the connection.
zh_hant: 請重新配對以恢復連線。

source: 读取通讯录以拨号、发短信
en: Read contacts to dial and text
zh_hant: 讀取通訊錄以撥號、發簡訊

source: 轻点左侧圆点选择通话方
en: Tap the circle to select a participant
zh_hant: 輕點左側圓點選擇通話方

source: 载入失败
en: Load Failed
zh_hant: 載入失敗

source: 载入更早的消息
en: Load Earlier Messages
zh_hant: 載入更早的訊息

source: 输入 +
en: Enter +
zh_hant: 輸入 +

source: 运营商
en: Carrier
zh_hant: 電信業者

source: 还没有导入号码名单。
en: No number lists imported yet.
zh_hant: 還沒有匯入號碼名單。

source: 还没有语音留言
en: No voicemails yet
zh_hant: 還沒有語音留言

source: 连接状态
en: Connection
zh_hant: 連線狀態

source: 退出
en: Sign Out

source: 退出演示模式
en: Exit Demo Mode
zh_hant: 退出示範模式

source: 退出这台手机
en: Unpair This Phone
zh_hant: 退出這台手機

source: 退出这台手机？
en: Unpair this phone?
zh_hant: 退出這台手機？

source: 选择 vCard 文件
en: Choose vCard File
zh_hant: 選擇 vCard 檔案

source: 选择外呼线路
en: Choose Outgoing Line
zh_hant: 選擇外呼線路

source: 选择操作
en: Choose Action
zh_hant: 選擇操作

source: 选择文件…
en: Choose File…
zh_hant: 選擇檔案…

source: 选择本地 TXT/JSON 文件
en: Choose Local TXT/JSON File
zh_hant: 選擇本機 TXT/JSON 檔案

source: 选择线路
en: Choose Line
zh_hant: 選擇線路

source: 选择该通话方
en: Select this participant
zh_hant: 選擇該通話方

source: 通讯录中的号码视为可信
en: Trust numbers in Contacts
zh_hant: 通訊錄中的號碼視為可信

source: 通讯录号码视为可信
en: Trust Contacts Numbers
zh_hant: 通訊錄號碼視為可信

source: 通讯录导入与整理
en: Contacts Import & Cleanup
zh_hant: 通訊錄匯入與整理

source: 通讯录整理
en: Contacts Cleanup
zh_hant: 通訊錄整理

source: 通讯录访问未授权
en: Contacts Access Not Authorized
zh_hant: 通訊錄存取未授權

source: 通话
en: Calls
zh_hant: 通話

source: 通话记录
en: Call History
zh_hant: 通話記錄

source: 配对内容
en: Pairing Content
zh_hant: 配對內容

source: 配对私钥与网关令牌
en: Pairing Private Key & Gateway Tokens
zh_hant: 配對私鑰與網關權杖

source: 配对网关
en: Pair Gateway
zh_hant: 配對網關

source: 重新导入本机通讯录
en: Re-import Device Contacts
zh_hant: 重新匯入本機通訊錄

source: 重新获取线路
en: Reload Lines
zh_hant: 重新取得線路

source: 重新连接
en: Reconnect
zh_hant: 重新連線

source: 重新选择文件
en: Choose a Different File
zh_hant: 重新選擇檔案

source: 重新配对
en: Pair Again
zh_hant: 重新配對

source: 重新配对统一网关
en: Re-pair Unified Gateway
zh_hant: 重新配對統一網關

source: 重试
en: Retry
zh_hant: 重試

source: 重试连接
en: Retry Connection
zh_hant: 重試連線

source: 键盘
en: Keypad
zh_hant: 鍵盤

source: 长按可粘贴或拷贝
en: Long-press to paste or copy
zh_hant: 長按可貼上或拷貝

source: 需确认
en: Needs Review
zh_hant: 需確認

source: 需要你确认（不会自动合并）
en: Needs your review (never merges automatically)
zh_hant: 需要你確認（不會自動合併）

source: 需要你确认（默认不合并）
en: Needs your review (no merge by default)
zh_hant: 需要你確認（預設不合併）

source: 音频尚未准备好。
en: Audio is not ready yet.
zh_hant: 音訊尚未準備好。

source: 音频已关闭。
en: Audio is closed.
zh_hant: 音訊已關閉。

source: 音频线路
en: Audio route
zh_hant: 音訊線路

source: 音频连接中断。
en: Audio connection lost.
zh_hant: 音頻連線中斷。

source: 音频通道建立失败，请检查网络后重试。
en: Couldn't establish audio; check your network and try again.
zh_hant: 音訊通道建立失敗，請檢查網路後重試。

source: 音频通道未能建立。
en: The audio channel could not be established.
zh_hant: 音訊通道未能建立。

source: 音频长时间未恢复，已结束通话。
en: Audio did not recover in time; the call has ended.
zh_hant: 音訊長時間未恢復，已結束通話。

source: 预览
en: Preview
zh_hant: 預覽

source: 预览演示：不会读取或写入任何真实通讯录。
en: Preview demo: no real contacts are read or written.
zh_hant: 預覽示範：不會讀取或寫入任何真實通訊錄。

source: 验证码/取件码等真实通知会被保护，不会因含“订单/验证码”字样被误拦；未知号码本身不等于垃圾。
en: Real notifications like verification/pickup codes are protected and won't be blocked just for containing 'order' or 'code'; an unknown number alone isn't spam.
zh_hant: 驗證碼/取件碼等真實通知會被保護，不會因含「訂單/驗證碼」字樣被誤攔；未知號碼本身不等於垃圾。

source: 高级选项
en: Advanced Options
zh_hant: 進階選項

source: 默认外呼线路，可临时切换
en: Default outgoing line; switchable per call
zh_hant: 預設外呼線路，可臨時切換

source: 默认拨出线路
en: Default Outgoing Line
zh_hant: 預設撥出線路

source: 默认线路
en: Default Line
zh_hant: 預設線路

source: 当前网关不支持线路质量测量。
en: This gateway doesn't support route quality measurement.
zh_hant: 目前閘道不支援線路品質測量。

source: 来电响铃中…
en: Incoming call…
zh_hant: 來電響鈴中…

source: 正在拨打…
en: Dialing…
zh_hant: 正在撥打…

source: 正在接通音频…
en: Connecting audio…
zh_hant: 正在接通音訊…

source: 通话中
en: In call
zh_hant: 通話中

source: 音频恢复中…
en: Recovering audio…
zh_hant: 音訊恢復中…

source: 正在挂断…
en: Ending…
zh_hant: 正在掛斷…

source: 通话结束
en: Call ended
zh_hant: 通話結束

source: 已保持
en: On hold
zh_hant: 已保留

source: 未知号码
en: Unknown number
zh_hant: 未知號碼

source: 参与中
en: In call
zh_hant: 參與中

source: 静音
en: Mute
zh_hant: 靜音

source: 扬声器
en: Speaker
zh_hant: 揚聲器

source: 合并
en: Merge
zh_hant: 合併

source: 音频已连接
en: Audio connected
zh_hant: 音訊已連接

source: 音频已连接 · 网络较差
en: Audio connected · poor network
zh_hant: 音訊已連接 · 網路較差

source: 音频已连接 · 延迟较高
en: Audio connected · high latency
zh_hant: 音訊已連接 · 延遲較高

source: 正在协商音频…
en: Negotiating audio…
zh_hant: 正在協商音訊…

source: 音频中断，正在恢复…
en: Audio interrupted, recovering…
zh_hant: 音訊中斷，正在恢復…

source: 音频连接失败
en: Audio connection failed
zh_hant: 音訊連接失敗

source: 未配对网关
en: Gateway not paired
zh_hant: 未配對閘道

source: 演示模式 · 不会拨打真实电话
en: Demo mode · no real calls
zh_hant: 演示模式 · 不會撥打真實電話

source: 正在连接网关…
en: Connecting to gateway…
zh_hant: 正在連接閘道…

source: 已注册 · %@
en: Registered · %@
zh_hant: 已註冊 · %@

source: 已注册到网络
en: Registered on network
zh_hant: 已註冊到網路

source: 正在搜索网络…
en: Searching for network…
zh_hant: 正在搜尋網路…

source: 网络注册被拒绝
en: Network registration denied
zh_hant: 網路註冊被拒絕

source: 注册状态未知
en: Registration unknown
zh_hant: 註冊狀態未知

source: 诊断
en: Diagnostics
zh_hant: 診斷

source: 导出诊断日志
en: Export Diagnostics
zh_hant: 匯出診斷

source: 清除诊断日志
en: Clear Diagnostics
zh_hant: 清除診斷

source: 聚合计数
en: Aggregate Counters
zh_hant: 聚計計數

source: 最近事件
en: Recent Events
